<template>
  <div class="readText">
      <van-nav-bar fixed title="用户注册协议" @click-left="onClickLeft" >
        <template #left>
          <img style="width:8px;height:14px" src="../../../assets/images/返回.png" alt />
        </template>
      </van-nav-bar>
    
    <div class="textContent">
      <p class="text">在此特别提醒您在注册成为“大美青海 青海省文化和旅游厅官方景区票务预约平台”（以下简称“大美青海”）用户之前,请认真阅读本《“大美青海 青海省文化和旅游厅官方景区票务预约平台”用户注册协议》(以下简称“协议”),确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。您同意并点击确认本协议条款且完成注册程序后,才能成为“大美青海”的正式注册用户,并享受“大美青海”的各类服务。您的注册、登录、使用等行为将视为对本协议的接受,并同意接受本协议各项条款的约束。若您不同意本协议,或对本协议中的条款存在任何疑问,请您立即停止“大美青海”用户注册程序,并可以选择不使用“大美青海”服务。本协议条款请您务必仔细阅读。</p>
       <p class="title">1.用户信息</p>
      <p class="text">当您在本网站进行用户注册登记，使用本网站的服务时，即为您同意本网站/将收集您的个人信息，并保存记录，请保证您提供的注册资料真实、准确、完整、合法有效。注册信息如有变动，请即时根据平台规则进行修改。本网站收集的个人信息包括但不限于：姓名、身份证号码、手机电话等。 </p>
        <p class="title">2、用户信息使用</p>
        <p class="text">本网站收集个人信息的基本目的是为了更好的服务我们的用户。个人信息将主要用于以下几个目的： （1）完成您对服务或产品的要求。（2）在我们提供服务时,用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途,确保我们向您提供的产品和服务的安全性。(3) 用于对本网站件用户数据的统计（如用户数量、构成等），以便我们向用户提供更好的服务和产品，该类统计数据都是用户群整体的信息，而非个人的信息。(4) 通过发送短信或以其他方式，告知用户相关信息。</p>
        <p class="text">为了让您有更好的体验、改善我们的服务或您同意的其他用途,在符合相关法律法规的前提下,我们可能将通过某一项服务所收集的信息,以汇集信息或者个性化的方式,用于我们的其他服务。例如,在您使用我们的一项服务时所收集的信息,可能在另一服务中用于向您提供特定内容,或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项,您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。</p>
        <p class="text">在未得到用户许可前，本网站不会将用户的任何个人信息提供给任何第三方，但发生以下事由的除外：</p>
        <p class="lit-text">（1）按照本网站制订的规则和程序，本网站有充分的理由相信已经获得用户的授权；</p>
        <p class="lit-text">（2）按照中华人民共和国的法律、法规、政策等规范性法律文件规定，要求本网站提供的；</p>
        <p class="lit-text">（3）不能归咎于本网站的客观情势，所导致的个人资料的公开；</p>
        <p class="lit-text">（4）因不可抗力，所导致的个人资料的公开；</p>
        <p class="lit-text">（5）由于用户自身过错，而导致的个人资料的公开；</p>
        <p class="lit-text">（6）超出本网站使用的硬件和软件的技术能力范围，所导致的个人资料的公开；</p>
        <p class="lit-text">（7）紧急情况下为维护用户个人或社会大众的隐私和安全的；</p>
        <p class="lit-text">（8）为维护本网站的所有权及相关权利的。</p>
        <p class="title">3、用户隐私</p>
        <p class="text">用户在平台进行浏览、预定时，涉及用户（包括但不限于）名称、联系电话、身份证号码等隐私信息的，平台将予以严格保密，除非得到用户的授权或法律另有规定或行政或司法机构的要求，平台不会向外界披露用户隐私信息。</p>
        <p class="text">我们会在您自愿的前提下收集您的个人信息并将这些信息进行整合,包括但不限于注册帐号时的相关信息等。尊重用户个人隐私是“大美青海”的一项基本政策。所以,“大美青海”不会公开或向任何第三方透露用户的注册资料以及用户因享受“大美青海”服务而提供的任何信息,但以下情形除外:</p>
        <p class="lit-text">(1)事先获得用户的明确授权或许可;</p>
        <p class="lit-text">(2)遵守有关法律规定,包括在国家有关机关查询时,提供用户的注册信息、用户在本站发布的信息内容及其发布时间、互联网地址或者域名等;</p>
        <p class="lit-text">(3)在紧急情况下竭力维护用户个人和社会大众的隐私安全;</p>
        <p class="title">4、用户使用规则</p>
        <p class="text">您可以在任何时候通过使用您的本网站的注册用户名和密码，查询，补充或更正您的本网站帐户中的个人信息，或要求删除您的本网站帐户中的个人信息。您在本网站的帐户可以被删除，但这样会导致您不能够登录本网站及使用本网站的任何服务。若发现任何非法使用用户帐号或存在安全漏洞的情况,请立即通知本站并向公安机关报案。因用户未妥善保管其帐号名称及密码而导致第三人使用帐号而给用户造成的损失,由用户自行承担</p>
        <p class="text">用户在注册及使用时应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线,且用户对其发布的内容(包括但不限于文字、图片等)时,不得有以下情形：</p>
        <p class="lit-text">(1)违反宪法或法律法规规定的;</p>
        <p class="lit-text">(2)危害国家安全,泄露国家秘密,颠覆国家政权,破坏国家统一的;</p>
        <p class="lit-text">(3)损害国家荣誉和利益的,损害公共利益的;</p>
        <p class="lit-text">(4)煽动民族仇恨、民族歧视,破坏民族团结的;</p>
        <p class="lit-text">(5)破坏国家宗教政策,宣扬邪教和封建迷信的;</p>
        <p class="lit-text">(6)散布谣言,扰乱社会秩序,破坏社会稳定的;</p>
        <p class="lit-text">(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的</p>
        <p class="lit-text">(8)侮辱或者诽谤他人,侵害他人合法权益的;</p>
        <p class="lit-text">(9)含有法律、行政法规禁止的其他内容或违反***的其他规定的。</p>
        <p class="title">5、信息安全</p>
        <p class="text">您的本网站帐户信息和本网站档案通过密码来保护，只有您个人才有权获取这些个人信息。我们建议您不要向任何他人泄露您的密码。本网站也不会主动致电或主动发电子邮件给您来询问您的密码，如果您遇到此类情况请及时与“大美青海”客服联系确认。同时，请您在完成工作后，务必退出您的本网站帐户并关闭您的浏览器窗口，以便当您与他人合用一台电脑，或正在公共场所使用电脑时，保证他人无法获取您的个人信息和往来通信。遗憾的是，任何通过互联网或无线网络的数据传输都无法获得绝对的安全保证。所以，在我们尽最大努力来保护您的个人信息的同时，本网站不能对您向我们进行的信息传输，或我们所发的在线产品或服务的信息的安全作出肯定或保证。您作出上述行为时将自己承担风险。一旦我们收到您传输来的信息，我们将尽最大努力保证其在我们系统的安全。</p>
        <p class="title">6、所有权及知识产权条款</p>
        <p class="text">“大美青海”由青海省文化和旅游厅拥有和维护。“大美青海”公开或显示的所有内容，包括但不限于文字、图表、照片、图像、动画、音效、插图及软件（简称“内容”）等，均属青海省文化和旅游厅所有。“大美青海”内的所有组成要素，包括但不限于整体设计及“内容”，均受商业外观、版权、道德规范、商标及其它所有相关知识产权的法律保护。除非依据本条款与条件或与经青海省文化和旅游厅在其它协议的声明同意外，“大美青海”內的任何部分或组成要素或“內容”均不得以任何方式复制或传播</p>
        <p class="title">7、责任限制</p>
        <p class="text">除非另有明确的书面说明,本站及其所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品(包括软件)和服务,均是在"按现状"和"按现有"的基础上提供的。我们不对本站的运营及其包含在本站上的信息、内容、材料、产品(包括软件)或服务作任何形式的、明示或默示的声明或担保(根据中华人民共和国法律另有规定的以外)。</p>
        <p class="title">8、免责声明</p>
        <p class="text">用户明确同意使用“大美青海”服务的风险由客户自己承担。“大美青海”明确表示不提供任何类型的担保，不论是明确的或隐含的。“大美青海”将尽力维护用户使用“大美青海”服务的合法权益，但不担保“大美青海”服务一定能满足客户的要求，也不担保服务的及时性、安全性、真实性、稳定性、正确性。对用户使用该等服务中出现的信息（包括但不限于客户发布的信息）删除或储存失败，“大美青海”亦不承担任何责任。</p>
        <p class="text">用户理解并接受下载或通过相应产品服务取得的任何信息资料取决于客户自己，并自行承担系统受损、资料丢失以及其他任何风险。</p>
        <p class="text">“大美青海”对本项服务下涉及的境内外基础运营商的通信网络的故障、技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、客户所在位置、客户关机或其他非“大美青海”技术能力范围内的事因等造成的服务中断、客户邮件内容丢失、出现乱码、错误接收、无法接收、迟延接收不承担责任。</p>
        <p class="text">“大美青海”保留判定客户的行为是否符合本服务协议要求的权利，如果客户违背了本服务协议的规定，“大美青海”有权中止或终止相应预定服务。</p>
        <p class="text">转户规定：如果客户将手机号码转让给他人，请用户提前自行删除“大美青海”内资料。否则，受让该号码的客户将能够查看您的客户个人数据。“大美青海”不承担由此引发的客户数据丢失等责任及纠纷。</p>
        <p class="title">9、协议更新及用户关注义务</p>
        <p class="text">根据国家法律法规的更新及网站运营需要,我们有权对本条款不时地进行修改,修改后的服务条款一旦被张贴在本站上即生效力,并代替原来的服务条款。用户可随时登录查阅最新服务条款内容。如用户不同意更新后的服务条款,应立即停止接受本站提供的服务;如用户继续使用本站提供的服务,即视为同意更新后的用户协议。我们建议您在使用本站之前阅读本用户协议及本站的公告。如果本用户协议中任何一条被视为废止无效或因任何理由不可执行,该条应视为可分的且并不影响任何其余协议的有效性和可执行性。</p>
        <p  class="title">10法律管辖和适用</p>
        <p class="text">本用户协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。如发生本服务条款的某些内容与适用之法律相抵触时,则这些条款将完全按法律规定重新解释,而其它有效条款继续有效。如缔约方就本条款內容或其执行发生任何争议,双方应尽力友好协商解决;协商不成时,任何一方均可向咕咚所在地的中华人民共和国大陆地区法院提起诉讼。</p>
        <p class="title">11、其他</p>
        <p class="text">我们尊重用户和消费者的合法权利,本用户协议及本站上发布的各类规则、政策、声明等其他内容,均是为了更好的、更加便利的为用户和消费者提供服务。“大美青海”欢迎用户和社会各界提出意见和建议,我们将虚心接受并适时修改本服务条款及相关政策、规则。</p>
        <p class="text">您完成注册且成为“大美青海”的注册用户则意味着您完全接受本用户协议,在注册之前请您再次确认已知悉并完全理解本用户协议的全部内容。</p>
    </div>


  </div>
</template>

<script>
import { NavBar } from "vant";
export default {
  name: "readText",
  components: {
    "van-nav-bar": NavBar,
  },
  methods: {
    onClickLeft() {
        this.$emit('close')
    },
  },
};
</script>

<style lang="less" scoped>
.readText {
  width: 100%;
  position: relative;
  .textContent {
    width: 100%;
    margin-top: 56px;
    padding-left: 10px;
    padding-right: 10px;
    box-sizing: border-box;
    p {
      font-size: 15px;
      font-family: MicrosoftYaHei;
      color: #333333;
      line-height: 24px;
      letter-spacing: 1px;
    }
    .text {
        text-indent: 2em;
    }
    .title{
        font-weight: bold;
        text-indent: 2em;
    }
      .lit-text{
          text-indent: 3em;

      }
  }
}
</style>
